<template lang="pug">
	el-dialog(:visible='show' title='提示' width="700px" :close-on-click-modal='false' :close-on-press-escape="false" :show-close="false")
		.contains
			h4 万里牛开放平台开发者协议
			p.backLeft-24 在使用万里牛开放平台（以下简称“开放平台”）服务之前，您应当认真阅读并遵守本协议的全部内容。请您务必审慎阅读、充分理解各条款的内容，包括但不限于免除或者限制万里牛责任的条款、对开发者权利进行限制的条款、争议解决和法律适用条款等。如果您对本协议的条款有疑问的，请通过万里牛客服渠道进行询问，万里牛将向您解释条款内容。如果您不同意本协议的任意内容，或者无法准确理解万里牛对条款的解释，请不要进行后续操作。否则，表示您已接受了以下所述的条款并愿意接受本协议约束。届时您不应以未阅读本协议的内容或者未获得万里牛对您问询的解答等理由，主张本协议无效，或要求撤销本协议。
			p 万里牛开放平台合作伙伴开发协议
			p 发布日期： 年 月 日

			p.sub-title 第一条 立约背景
			p.backLeft-24 1.1 为了规范万里牛开放平台开发者(以下简称“开发者”或“您”)通过开放平台进行的各项行为，包括但不限于通过开放平台调用应用数据接口（即API），明确开发者的权利义务，营造规范、有序、安全的开放平台环境，保障开发者的合法权益，依据《万里牛服务协议》、《隐私协议》，拟定本协议。

			p.sub-title 第二条 签约主体
			p.backLeft-24 2.1 本协议由杭州湖畔网络技术有限公司（以下简称“甲方”或“万里牛”）与开发者签署。
			
			p.sub-title 第三条 协议生效和适用范围
			p.backLeft-24 3.1 您通过网络页面点击确认或以其他方式选择接受本协议，即表示您与万里牛已达成一致并同意接受本协议的全部约定内容。本协议自您确认接受之时起或自您使用万里牛开放平台服务的行为发生之时起（以时间在先者为准）生效。
			p.backLeft-24 3.2 本协议内容包括协议正文以及所有万里牛已经发布的或将来可能发布的各类规则（含业务规范，以下同）、通知、公告等（以下合称“规则”），包括但不限于《万里牛服务协议》、《隐私协议》等。所有规则为协议不可分割的组成部分，与协议正文具有同等法律效力。万里牛有权根据需要不时地制定、修改本协议或各类规则，如有任何变更，万里牛将于开放平台的公告版块进行公告，而不再单独通知您。变更后的协议和规则一经公布即自动生效，成为本协议的一部分。如您不同意相关变更，应当立即停止使用万里牛开放平台服务；如您继续使用万里牛开放平台服务的，则视为您对修改后的协议和规则不持异议并同意遵守。
			
			p.sub-title 第四条 定义
			p.backLeft-24 4.1 万里牛开放平台（以下简称“开放平台”）：指基于万里牛开放平台各类业务的开放，由万里牛提供一些软件和支持材料，开发者通过这些软件和支持材料开发应用以便服务于自身。开发者可以通过开放平台应用编程接口调用指定的功能服务，访问由万里牛提供的或开发者授权的与开发者相关的数据或来自其他万里牛应用程序的数据信息，或者由开发者应用向万里牛提供、回流数据。开放平台可能包括但不限于一个或多个API、编程工具和文档。
			p.backLeft-24 4.2 开发者：指万里牛开放平台注册用户通过过有效申请并通过验证的可以基于开放平台进行应用开发的单位或者个人，在开放平台开发者也可称为“开发者”。
			p.backLeft-24 4.3 Appkey & Appsecret：指开发者在使用万里牛开放平台服务时获得的由万里牛授予的应用程序接入账户和密钥。Appkey是开发者的唯一标识，万里牛通Appkey 来识别开发者的身份；Appsecret是万里牛给开发者分配的密钥，该密钥在一定技术条件下可保证来源的可靠性。
			p.backLeft-24 4.4 基础API：指对所有业务开放、开发者需申请授权即可自由使用的开放平台数据接口。基础API按照万里牛收费模式为一次收费或按年收费。万里牛可能会基于业务发展对API服务进行调整，请开发者密切关注万里牛开放平台的业务公告及相关API文档。
			
			p.sub-title 第五条 万里牛服务内容
			p.backLeft-24 5.1 万里牛为开发者提供应用开发的相关网络环境和技术支持，包括应用数据接口的开发、封装，应用开发、运行的系统环境，以及与此有关的互联网技术服务。开发者同意依照本协议的约定向乙方支付使用开放平台相关技术服务的使用费用。甲方提供的个别服务暂时不收取费用（例如开放平台接入测试环境、SDK、测试工具等），但甲方保留今后进行收费的权利。
			p.backLeft-24 5.2 乙方按照标准接口文档提供数据开放业务，乙方提供的数据开放业务中不包含各电商平台订单中敏感个人信息（包括不限于用户ID、姓名、联系电话、详细地址），如乙方基于国家法律法规或平台规则对数据开放业务进行调整的，以各电商平台或乙方的最新公告为准。
			p.backLeft-24 5.3 如存在下列情况，万里牛以普通或非专业人员的知识水平标准对相关内容进行判别，可以认为这些内容或行为具有违法或不当性质的，万里牛有权删除相关信息或停止对该开发者提供服务，并追究其法律责任：
			p.backLeft-48 5.3.1 第三方通知万里牛，认为某个开发者或具体应用事项可能存在重大问题；
			p.backLeft-48 5.3.2 第三方向万里牛告知开放平台上有违法或不当行为，例如开发者非法获取或使用第三方数据等。
			p.backLeft-24 5.4 对于开发者使用开放平台服务过程中发布、传输涉嫌违法、侵犯第三人合法权益、违反公序良俗、社会公德等不妥当信息的，或者开发者账户存在异常活动的，万里牛有权采取包括不限于暂停该等账户的使用、向开发者发出询问或要求改正的通知、或者删除有害信息等处理措施。
			
			p.sub-title 第六条 开放平台服务使用规则
			p.backLeft-24 6.1 开发者承诺同时遵守《万里牛服务协议》、《隐私协议》。
			p.backLeft-24 6.2 开发者成功入驻开放平台后，万里牛将根据您的登录账户和密码确认您的身份。您应妥善保管账户和密码，并对使用该账户和密码所进行的一切行为承担全部责任。您承诺在密码或账户遭到未获授权的使用，或者发生其他安全问题时，将立即通知万里牛，且您同意并确认，除非因万里牛过错导致账户被盗，万里牛不对上述情形产生的任何直接或间接的遗失或损害承担责任。
			p.backLeft-24 6.3 开发者声明并保证其使用开放平台服务过程中遵守如下要求：
			p.backLeft-48 6.3.1 不复制、模仿、修改、篡改、翻译、改编、出借、出售、转许可、在信息网络上传播或转让开放平台服务和/或相关软件，也不得逆向工程、反汇编、反编译、分解拆卸或试图以其他方式发现开放平台服务/软件的源代码，或者在未经明确允许的情况下创作衍生作品；
			p.backLeft-48 6.3.2 不从事避开或修改万里牛数据统计工具的行为；
			p.backLeft-48 6.3.3 不发送和储存带有病毒的、蠕虫的、木马和其他有害的计算机代码、文件、脚本和程序；
			p.backLeft-48 6.3.4 不利用万里牛提供的资源和服务上传、下载、储存、发布任何违法违规、侵权、淫秽、色情、不道德、欺诈、诽谤（包括商业诽谤）、非法恐吓或非法骚扰等信息或内容，不为他人发布该等信息提供任何便利（包括但不限于设置URL、BANNER链接等）；
			p.backLeft-48 6.3.5 不侵犯万里牛和/或其关联公司或任何第三方的合法权益；
			p.backLeft-48 6.3.6 如开放平台服务涉及第三方软件之许可使用的，您同意遵守相关的许可协议的约束；
			p.backLeft-48 6.3.7 不从事其他违法、违规或不恰当的行为。
			p.backLeft-24 6.4 开发者通过开放接口服务收集、使用、传输个人数据的，应当符合以下条件：
			p.backLeft-48 6.4.1 开发者必须事先获得数据所有者的同意，且应当告知数据所有者相关数据收集的目的、范围及使用方式，保障数据所有者知情权。
			p.backLeft-24 6.5 开发者违反法律法规、电商平台规则或本协议的约定非法获取或不当使用相关数据的，万里牛有权采取直接终止本协议、删除开发者已获取的相关数据等措施，且前述措施可以合并使用；开发者应当以自己的名义独立承担全部责任，并对万里牛、或任何第三方造成的损失进行赔偿。
			p.backLeft-24 6.6 开发者同意接收来自万里牛及其关联公司发出的邮件、信息。
			p.backLeft-24 6.7 开发者在开放平台获取权限后，开发者ERP的管理员账号将得到一个针对该ERP唯一的Appkey 和Appsecret 。开发者同意通过开放平台提供的途径合法获取应用标识（Appkey）及密钥（Appsecret）。开发者对Appkey和Appsecret的机密负完全责任。开发者同意在发现或怀疑他人未经授权就使用其Appkey和Appsecret时立即通知万里牛。万里牛对开发者的Appkey和Appsecret的所有使用情况，包括但不限于任何未经授权的访问、更改或者删除、破坏、损害、丢失或未能存储均不承担任何责任。
			p.backLeft-24 6.8 开发者使用开放平台服务传输的数据不包含各电商平台订单中敏感个人信息（包括不限于用户ID、姓名、联系电话、详细地址），如万里牛基于国家法律法规或平台规则对数据开放业务进行调整的，以各电商平台或万里牛的最新公告为准。
			
			p.sub-title 第七条 开放平台技术服务费收费标准、费用支付及结算
			p.backLeft-24 7.1 万里牛提供的服务及收费标准：
			p.backLeft-48 7.1.1 API接口技术服务
			p.backLeft-48 万里牛对所有调用开放平台API接口的开发者收取相应技术服务费。
			p.backLeft-48 7.1.2 API接口增值服务
			p.backLeft-48 如开发者对于万里牛提供的标准文档里所含的接口或者字段，需要增加，修改或者删除时，经万里牛评估确认后，开发者需要与万里牛新签二次开发合同，万里牛将根据合同约定收取相应开发费用。
			p.backLeft-24 7.2 开放平台技术服务费支付及结算
			p.backLeft-48 7.2.1 开发者应在使用API接口技术服务前支付技术服务费，否则，万里牛有权不提供或中止、终止、限制性提供相关技术服务。
			p.backLeft-48 7.2.2 开发者可通过开放平台自助下单购买API权限包。

			p.sub-title 第八条  知识产权
			p.backLeft-24 8.1 万里牛开放平台上所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由万里牛或其他权利人依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。非经万里牛或其他权利人书面同意任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表万里牛网站程序或内容。
			p.backLeft-24 8.2 根据本协议的条款和条件，万里牛授予开发者有限的、非排他性的、可终止的和不可再分发的许可，仅限于开发者或开发者基于自身业务需要授权的第三方在访问和使用开放平台开发、测试、显示其应用时，允许其访问万里牛提供的或开发者自身授权的数据信息。
			p.backLeft-24 8.3 开发者保留其创建的应用内容以及其中包括的所有权利、权属或权益，包括但不限于归属于开发者的知识产权（但万里牛知识产权除外）。
			
			p.sub-title 第九条  违约责任
			p.backLeft-24 9.1 您明确理解并同意万里牛有权以普通或非专业人员的知识水平标准对您的行为进行认定，如万里牛认定您的行为存在违反法律法规、平台禁止性规则等严重情形的，万里牛有权单方决定中止、终止向您提供服务（包括中止或终止开放平台API的调用，以下同）。
			p.backLeft-24 9.2 如因您违反有关法律法规、电商平台规则或者本协议、相关规则之规定，使万里牛遭受损失，包括不限于第三方索赔、电商平台或任何行政管理部门的处罚等，万里牛有权就因此遭受的损失主张赔偿，包括合理的维权费用。
			
			p.sub-title 第十条  免责和有限责任
			p.backLeft-24 10.1 万里牛将在现有技术的基础上尽最大努力提供相应的安全措施以保障服务安全和正常运行。万里牛不对因下述任一情况而导致的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿（无论万里牛是否已被告知该等损害赔偿的可能性）：
			p.backLeft-48 10.1.1 使用或未能使用“服务”； 
			p.backLeft-48 10.1.2 第三方未经批准的接入或第三方更改开发者的传输数据或数据；
			p.backLeft-48 10.1.3 第三方对“服务”的声明或关于“服务”的行为；或非因万里牛的原因而引起的与“服务”有关的任何其它事宜，包括疏忽；
			p.backLeft-48 10.1.4 可能存在的计算机病毒、网络通讯故障、系统停机维护、电商开放平台政策调整、聚石塔等电商云计算环境故障，或因其他不可抗力原因导致的故障。
			p.backLeft-24 10.2 在任何情况下，万里牛均不对任何间接性、后果性、惩戒性、偶然性、特殊性或刑罚性的损害，包括开发者使用开放平台而遭受的利润损失，承担责任（即使万里牛已被告知该等损失的可能性）。
			p.backLeft-24 12.3 尽管本协议中可能含有相反的规定，万里牛对开发者承担的最大的总体责任和赔偿不超过开发者已支付给万里牛的软件服务费总额。

			p.sub-title 第十一条  协议终止与转让
			p.backLeft-24 11.1 本协议在符合以下任意一项情形时终止：
			p.backLeft-48 11.1.1 自然终止：如您签署的《万里牛软件最终用户使用许可采购协议》或其他相关协议因任何原因终止，则本协议将同时终止；
			p.backLeft-48 11.1.2 单方解除权：出现下列情况之一的，万里牛有权立刻终止本协议：
			p.backLeft-36 11.1.2.1 您违反本协议中的任何承诺或保证，包括但不限于本协议项下的任何约定，经万里牛催告后，15天内仍未更正的；
			p.backLeft-36 11.1.2.2 您违反法律法规、电商平台规则，或万里牛平台的相关条款、协议、规则、通告等相关规定，而被万里牛平台终止提供服务的；
			p.backLeft-48 11.1.3 本协议规定的其他协议终止条件发生或实现，导致本协议终止。
			p.backLeft-24 11.2 协议终止后的处理：
			p.backLeft-48 11.2.1 服务终止后，万里牛没有义务为开发者保留原账户中或与之相关的任何信息，或转发任何未曾阅读或发送的信息给开发者或第三方，亦不就终止服务而对开发者或任何第三方承担任何责任。
			p.backLeft-48 11.2.2 不论万里牛与开发者之间的服务因任何原因以任何方式终止， 对于开发者在服务终止前实施的违法或违约行为所导致的任何赔偿和责任， 开发者必须完全独立地承担，万里牛有追索权；
			p.backLeft-24 11.3 无论本协议因何原因终止，在协议终止前的行为所导致的任何责任，您必须完全且独立地承担；协议终止后，万里牛无需继续向您提供服务。
			p.backLeft-24 11.4 万里牛有权将本协议项下的全部权利和义务转让予万里牛的关联公司，而无须事先征得您的同意，届时万里牛将通过网站公告等方式向您发出转让通知。

			p.sub-title 第十二条  通知和送达
			p.backLeft-24 12.1 万里牛对于开发者所有的通知均可通过网页公告、电子邮件、万里牛ERP客户端推送、万里牛站内信、手机短信或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。
			p.backLeft-24 12.2 开发者对于万里牛的通知应当通过万里牛对外正式公布的通信地址、电子邮件地址等联系信息进行送达。

			p.sub-title 第十三条  法律适用与管辖
			p.backLeft-24 13.1 本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国大陆地区法律。
			p.backLeft-24 13.2 因万里牛与您就本协议的签订、履行或解释发生争议，双方应努力友好协商解决。如协商不成，万里牛和您均同意由被告住所地人民法院作为第一审管辖法院。
			
			div(style="display: flex; justify-content: center; align-items: center;font-size: 16.5px")
				el-checkbox(v-model="check") 我已阅读并同意
		span.footer-btn(slot="footer")
			el-button.button-w--110(type="primary" @click="confirm" :disabled="!check") 我知道了

</template>

<script>

export default {
	components: {},
	props: {
		show: Boolean
	},
	mixins: [],
	data() {
		return {
			check: false
		};
	},
	computed: {},
	watch: {},
	created() {},
	mounted() {},
	methods: {
		confirm () {
			if (!this.check) return
			this.$emit('confirm')
		}
	},
	}
</script>
<style lang='scss' scoped>
//@import url(); 引入公共css类
.contains {
	padding: 40px 32px 0px;
	height: 500px;
	overflow: scroll;
    background: #fff;
	h4 {
		text-align:center;
		font-size:22px;
		margin:0 0 20px 0;
	}
	p {
		display: block;
		margin-block-start: 1em;
		margin-block-end: 1em;
		margin-inline-start: 0px;
		margin-inline-end: 0px;
		font-size: 14px;
	}
	.backLeft-12 {
		text-indent: 12px;
	}
	.backLeft-24 {
		text-indent: 24px;
	}
	.backLeft-36 {
		text-indent: 48px;
	}
	.backLeft-48 {
		text-indent: 36px;
	}
	b {
		font-size: 14px;
	}
	.sub-title {
		font-weight: bold;
		line-height: 40px;
	}
}
</style>